.doom.d/config.org
#+PROPERTY: header-args :results none :comments link
#+startup: num
#+options: toc:2
#+title: Doom Emacs Config
#+author: Nathan Sharp (@nazzacode)
#+description: Nathan's (nazzacode's) Personal Doom Emacs config.

* Table of Contents :toc:
:PROPERTIES:
:UNNUMBERED:
:END:
-  [[#magic-incantation][Magic Incantation]]
- [[#user-info][User Info]]
- [[#better-defaults][Better Defaults]]
- [[#ui][UI]]
  - [[#theme][Theme]]
  - [[#fonts][Fonts]]
  - [[#window-divider][Window Divider]]
  - [[#modeline][Modeline]]
  - [[#writeroom-mode][Writeroom Mode]]
  - [[#strt-fix-end_src-background-bleeding][STRT Fix ~#+end_src~ background bleeding]]
- [[#org][Org]]
  - [[#general][General]]
  - [[#collect-ui-section][Collect UI Section!]]
  - [[#headings][Headings]]
  - [[#todos][Todo's]]
  - [[#tags][Tags]]
  - [[#tables][Tables]]
  - [[#org-roam][Org-roam]]
  - [[#org-roam-bibtex-orb][Org-roam-bibtex (ORB)]]
  - [[#org-ref][Org-ref]]
  - [[#helm-bibtex][Helm-bibtex]]
  - [[#org-babel-src-blocks][Org-Babel (src blocks)]]
  -  [[#jupyter][Jupyter]]
  - [[#org-noter][Org-noter]]
  - [[#hypothesis][Hypothesis]]
  - [[#show-properties-drawer][Show Properties (Drawer)]]
- [[#dired][Dired]]
  - [[#peep-dired][peep-dired]]
- [[#agenda][Agenda]]
  - [[#clean-category-column-garbage][Clean category column garbage]]
- [[#calender][Calender]]
- [[#treemacs][Treemacs]]
- [[#pdf-tools][Pdf (tools)]]
- [[#novel][Nov.el]]
- [[#latex][Latex]]
- [[#direnv-nix][Direnv (Nix)]]
- [[#typescript][Typescript]]
- [[#misc][Misc]]

*  Magic Incantation
Harnes the performance advantages of lexical-binding. See:
  1. [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][GNU: Lexical Binding]]
  2. [[https://nullprogram.com/blog/2017/01/30/][How to Write Fast(er) Emacs Lisp]]
  3. [[https://nullprogram.com/blog/2016/12/22/][Some Performace Advantages of Lexical Scope]]

#+BEGIN_SRC elisp
;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+END_SRC

* User Info
"For GPG configuration, email clients, file templates and snippets." - Doom Emacs
#+BEGIN_SRC elisp
(setq user-full-name "Nathan Sharp"
      my-name "nazzacode"
      user-mail-address "nasharp@outlook.com")
#+END_SRC

* Better Defaults
#+begin_src elisp
(setq auto-save-default t
      make-backup-files t
      tab-width 2)

(setq-default tab-width 2)

(pixel-scroll-mode 1) ; smooth scrolling

#+end_src

* UI
#+begin_src elisp
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)      ; icons in dired

;; highlight-indent-guide
(add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
;; (add-hook 'org-mode-hook 'highlight-indent-guides-mode) ; FIXME background color

(setq highlight-indent-guides-method 'character
      highlight-indent-guides-responsive 'stack)

(setq display-line-numbers-type 'relative  ; or `nil'
      +ivy-buffer-preview t                ; preview buffer on switch
      emojify-emoji-set "emojione-v2.2.6")  ; increase resolution from default "emojione-v2.2.6-22"

;; Rainbow mode :: colorise strings that represent colors
(define-globalized-minor-mode global-rainbow-mode rainbow-mode
  (lambda () (rainbow-mode 1)))

(global-rainbow-mode 1)
#+end_src
** Theme
#+BEGIN_SRC elisp
;; (setq doom-theme 'my-doom-dark+)
(setq doom-theme 'my-doom-gruvbox)
#+END_SRC

** Fonts

#+BEGIN_SRC elisp
;; (use-package! mixed-pitch
;;   :hook (org-mode . mixed-pitch-mode)
;;   :config
;;   (setq variable-pitch-set-heigth 't)
;;   (set-face-attribute 'variable-pitch nil :height 1.5))

;; (setq doom-font (font-spec :family "Hasklug Nerd Font Mono") ;  :size 26 :height 1.0)     ; Agave Nerd Font Mono
;;       doom-variable-pitch-font (font-spec :family "Iosevka Aile") ; :size 32 :height 1.5)  ; ETBookOT
;;       doom-unicode-font (font-spec :family "Symbola")          ; good unicode support
;;       ;; doom-big-font (font-spec :family "Fira Mono" :size 19))
;;       ;; doom-variable-pitch-font (font-spec :family "TSCu_Comic")
;;)
#+END_SRC
** Window Divider
#+begin_src elisp
;; (defun my-change-window-divider ()
;;   (let ((display-table (or buffer-display-table standard-display-table)))
;;     (set-display-table-slot display-table 5 ?│)
;;     (set-window-display-table (selected-window) display-table)))

;; (add-hook 'window-configuration-change-hook 'my-change-window-divider)
#+end_src

** TODO Modeline
#+begin_src elisp
;; TODO minibuffer modeline + centaur

;; (custom-set-faces!
;;     '(mode-line :family "Iosevka Aile")  ; :height 0.85)
;;     '(mode-line-inactive :family "Iosevka Aile"))  ; :height 0.85))

(setq doom-modeline-height 35
      doom-modeline-major-mode-icon t)
#+end_src

** TODO Writeroom Mode
#+begin_src elisp
;; TODO increase font less
;;(setq writeroom-mode-line t)
#+end_src
** STRT Fix ~#+end_src~ background bleeding
:PROPERTIES:
:ID:       be0b37d4-6ae9-45d0-ba48-54c42bdc3e67
:END:
#+begin_src elisp
;; HELP The following code seems to be lasting on theme change (even when commented)!
;; (custom-set-faces
;;  '(org-block-begin-line ((t (:background "#1e1e1e"))))
;;  '(org-block-end-line   ((t (:background "#1e1e1e")))))
;; (custom-theme-set-faces
;;  'gruvbox-dark
;;  '(org-block-begin-line ((t (:background "#713adf"))))
;;  '(org-block-end-line   ((t (:background "#aaaaaa")))))
#+end_src
* Org
** General
#+begin_src elisp
(after! org
  (add-hook! 'org-mode-hook #'+org-pretty-mode   ; hides emphasis markers and toggles "pretty entities"
                            #'org-appear-mode    ; expand invisible emphasis markers etc.
                            #'mixed-pitch-mode)  ; uses var-pitch font for text

  (setq org-directory "~/org"              ; dir for agenda etc.
        org-num-skip-unnumbered t          ; skip `:UNNUMBERED:` from numbering
        org-ellipsis "  "
        display-line-numbers-type 'nil
        ;; hl-line-mode 'nil                  ; FIXME saw a forum saying this is broken
        org-startup-with-inline-images 't  ; TODO check if working
        org-startup-with-latex-preview 't
        org-startup-shrink-all-tables 't
        org-startup-folded 't))            ; FIXME not working

(require 'org-superstar)  ; NEEDED?
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))

;; (setq org-blank-before-new-entry
;;   '((heading . t) (plain-list-item . t)))
#+end_src
** TODO Collect UI Section!
** Headings
#+begin_src elisp
;; TODO increase sizes?
;; line weights: normal, semi-bold, bold
(custom-set-faces!
  '(outline-1 :weight normal :height 1.24) ;1.12)
  '(outline-2 :weight normal :height 1.16) ;1.08)
  '(outline-3 :weight normal :height 1.10) ;1.05)
  '(outline-4 :weight normal :height 1.06) ;1.03)
  '(outline-5 :weight normal :height 1.04) ; 1.02
  '(outline-6 :weight normal :height 1.02) ;1.01)
  '(outline-7 :weight normal)
  '(outline-8 :weight normal)
  '(org-document-title :weight normal :height 1.8)) ; 1.2
#+end_src
** Todo's
#+begin_src elisp
(setq org-todo-keywords '(
  (sequence "TODO(t)" "DOING(d)" "STRT(s)" "NEXT(n)" "PROJ(p)" "WAIT(w)" "MAYBE(m)" "ERROR(e)" "FIXME(f)" "UPDATE(u)" "(x)" "|" "DONE(D)" "CANCL(c)" "DEPRECATED(E)")
  (sequence "[ ](T)" "[-](-)" "[?](?)" "|" "[X](X)")
  (sequence "|" "OKAY(o)" "YES(y)" "NO(N)")
))

(setq org-todo-keyword-faces '(
  ("TODO" . (:foreground "DarkSeaGreen3" :weight semi-bold))
  ("DOING" . (:foreground "light goldenrod" :weight semi-bold +org-todo-active))
  ("STRT" . (:foreground "#9083e6" :weight semi-bold +org-todo-active))
  ("NEXT" . (:foreground "light salmon" :weight semi-bold))
  ("PROJ" . (:foreground "PeachPuff3" :weight semi-bold +org-todo-project))
  ("WAIT" . (:foreground "powder blue" :weight semi-bold +org-todo-onhold))
  ("MAYBE" . (:foreground "light pink" :weight semi-bold +org-todo-onhold))
  ("ERROR" . (:foreground "IndianRed" :weight semi-bold))
  ("FIXME" . (:foreground "IndianRed4" :weight semi-bold))
  ;; ("DONE" . (:foreground "" :Weight bold))
  ("CANCL" . (:foreground "grey11" :weight semi-bold +org-todo-cancel))
  ("[-]" . +org-todo-active)
  ("[?]" . +org-todo-onhold)
  ("NO" . +org-todo-cancel)
))
#+end_src

** Tags
#+begin_src elisp
(setq org-tag-persistent-alist
      '((:startgroup . nil)
        ("uni" . ?u)
        ("computing" . ?c)
        ("graph_theory" . ?g)
        ("math" . ?m)
        ("philosophy" . ?p)
        ("phychology" . ?P)
        ("research" . ?r)
        ("my" . ?m)
        ("money" . ?M)
        (:endgroup . nil)
        ("noexport" . ?x)
))
#+end_src

** Tables
#+begin_src elisp
;; (add-hook 'org-mode-hook #'valign-mode)
;; (setq valign-fancy-bar 'non-nil)
#+end_src

